// @strict-types

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", 
	               ПользовательИБ.УникальныйИдентификатор); 
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не найден текущий пользователь в справочнике Пользователи. Обратитесь к адмнистратору.";
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


